dhzl84/ESP8266-Smart-Home/src/main.cpp
   /* check name for MQTT */
   String myName = readSpiffs(SPIFFS_MQTT_ID_FILE);

   if (myName != "")
   {
      myMqttConfig.setName(myName); /* set name from spiffs here, thus setup only needs to set the main topic */
   }
   else
   {
      Serial.println("File " + SPIFFS_MQTT_ID_FILE + " is empty or does not exist, proceed as 'unknown'");
   }
   Serial.println("My name is: " + myMqttConfig.getName());

   String sensorCalib = readSpiffs(SPIFFS_SENSOR_CALIB_FILE);

   /* check parameters for Sensor calibration */
   if (sensorCalib != "")
   {
      int offset;
      int factor;

      /* split parameter string */
      if (splitSensorDataString(sensorCalib, &offset, &factor))
      {
         #ifdef CFG_DEBUG
         Serial.println("Offset read from /sensor is: " + String(offset) + " *C");
         Serial.println("Factor read from /sensor is: " + String(factor) + " %");
         #endif

         myThermostat.setSensorCalibData(offset, factor, false);
      }
      else
      {
         Serial.println("File " + SPIFFS_SENSOR_CALIB_FILE + " returned malformed string, proceed with uncalibrated sensor");
      }
   }
   else
   {
      Serial.println("File " + SPIFFS_SENSOR_CALIB_FILE + " is empty or does not exist, proceed with uncalibrated sensor");
   }

   String targetTemp = readSpiffs(SPIFFS_TARGET_TEMP_FILE);
   if (targetTemp != "")
   {
      myThermostat.setTargetTemperature(targetTemp.toInt()); /* set temperature from spiffs here*/
      Serial.println("File " + SPIFFS_TARGET_TEMP_FILE + " is available, proceed with value: " + String(myThermostat.getTargetTemperature()));
   }
   else
   {
      Serial.println("File " + SPIFFS_TARGET_TEMP_FILE + " is empty or does not exist, proceed with init value: " + String(myThermostat.getTargetTemperature()));
   }

   SPIFFS_LAST_TARGET_TEMPERATURE = myThermostat.getTargetTemperature(); /* store this value also here to avoid unnecessary usage of SPIFFS */
}

void GPIO_CONFIG(void)
{
   myThermostat.setup(RELAY_PIN, myThermostat.getTargetTemperature()); /*GPIO to switch connected relay and initial target temperature */

   /* initialize encoder pins */
   pinMode(ENCODER_PIN1, INPUT_PULLUP);
   pinMode(ENCODER_PIN2, INPUT_PULLUP);
   pinMode(ENCODER_SWITCH_PIN, INPUT_PULLUP);
}

/* Display */
void DISPLAY_INIT(void)
{
   #ifdef CFG_DEBUG
   Serial.println("Initialize display");
   #endif
   Wire.begin();   /* needed for I�C communication with display */
   myDisplay.init();
   myDisplay.flipScreenVertically();
   myDisplay.clear();
   myDisplay.setFont(Roboto_Condensed_16);
   myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
   myDisplay.drawString(64,22,"Initialization");
   myDisplay.display();
}

void WIFI_CONNECT(void)
{
   /* init WiFi */
   if (WiFi.status() != WL_CONNECTED)
   {
      #ifdef CFG_DEBUG
      Serial.println("Initialize WiFi ");
      #endif

      WiFi.mode(WIFI_STA);
      WiFi.begin(ssid, password);

      #ifdef CFG_DEBUG
      Serial.println("WiFi Status: "+ String(WiFi.begin(ssid, password)));
      #endif
   }

   /* try to connect to WiFi, proceed offline if not connecting here*/
   while (WiFi.waitForConnectResult() != WL_CONNECTED) {
     Serial.println("Failed to connect to WiFi, continue offline");
     mySystemState.setSystemState(systemState_offline);
     return;
   }

   mySystemState.setSystemState(systemState_online);
   Serial.print("IP address: ");
   Serial.println(WiFi.localIP());

}

/* OTA */
void OTA_INIT(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      /* convert string to char* */
      char *mqttName = new char[myMqttConfig.getName().length() + 1];
      strcpy(mqttName,myMqttConfig.getName().c_str());

      ArduinoOTA.setHostname(mqttName);

      delete [] mqttName;

      ArduinoOTA.onStart([]()
      {
         OTA_UPDATE = TH_OTA_ACTIVE;
         DRAW_DISPLAY_MAIN();
         Serial.println("Start");
      });

      ArduinoOTA.onEnd([]()
      {
         OTA_UPDATE = TH_OTA_FINISHED;
         DRAW_DISPLAY_MAIN();
         Serial.println("\nEnd");
      });

      ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
      {
         Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
      });

      ArduinoOTA.onError([](ota_error_t error)
      {
         OTA_UPDATE = TH_OTA_ERROR;
         DRAW_DISPLAY_MAIN();

         Serial.printf("Error[%u]: ", error);
         if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
         else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
         else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
         else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
         else if (error == OTA_END_ERROR) Serial.println("End Failed");
      });
      ArduinoOTA.begin();
   }
}

void MQTT_CONNECT(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      boolean ret;
      /* convert name string to char for connect API */
      char *mqttName = new char[myMqttConfig.getName().length() + 1];
      strcpy(mqttName,myMqttConfig.getName().c_str());

      /* convert name string to char for setWill API */
      char *mqttWillTopic = new char[myMqttConfig.getTopicState().length() + 1];
      strcpy(mqttWillTopic, myMqttConfig.getTopicState().c_str());

      /* broker shall publish 'offline' on ungraceful disconnect >> Last Will */
      myMqttClient.setWill(mqttWillTopic ,"offline", true, 1);
      myMqttClient.begin(mqttHost, mqttPort, myWiFiClient);
      myMqttClient.onMessage(messageReceived);       /* register callback */
      ret = myMqttClient.connect(mqttName, LOCAL_MQTT_USER, LOCAL_MQTT_PWD);

      /* subscribe some topics */
      ret = myMqttClient.subscribe(myMqttConfig.getTopicTargetTempCmd());
      ret = myMqttClient.subscribe(myMqttConfig.getTopicThermostatModeCmd());
      ret = myMqttClient.subscribe(myMqttConfig.getTopicUpdateFirmware());
      ret = myMqttClient.subscribe(myMqttConfig.getTopicChangeName());
      ret = myMqttClient.subscribe(myMqttConfig.getTopicChangeSensorCalib());
      ret = myMqttClient.subscribe(myMqttConfig.getTopicSystemRestartRequest());

