dhzl84/ESP8266-Smart-Home/src/main.cpp
void MQTT_MAIN(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      if(!myMqttClient.connected())
      {
         if (TimeReached(mqttReconnectTime))
         {
            MQTT_CONNECT();
            SetNextTimeInterval(mqttReconnectTime, mqttReconnectInterval); /* reset interval if MQTT_CONNECT was called*/
         }
         else  /* try reconnect to MQTT broker after mqttReconnectTime expired */
         {
           /* just wait */
         }
         return; /* no MQTT connection */
      }
      else
      {
         SetNextTimeInterval(mqttReconnectTime, mqttReconnectInterval); /* reset interval  if everything is fine */
      }

      /* HTTP Update */
      if (FETCH_UPDATE == true)
      {
         myMqttClient.publish(myMqttConfig.getTopicUpdateFirmwareAccepted(), String(false)); /* publish accepted update with value false to reset the switch in Home Assistant */
      }

      /* check if there is new data to transmit */
      if (myThermostat.getNewData())
      {
         myThermostat.resetNewData();
         myMqttClient.publish(myMqttConfig.getTopicData(), myMqttConfig.buildJSON(String(intToFloat(myThermostat.getFilteredTemperature())), String(myThermostat.getFilteredHumidity()), String(boolToStringOnOff(myThermostat.getActualState())), String(intToFloat(myThermostat.getTargetTemperature())), String(myThermostat.getSensorError()), String(boolToStringHeatOff(myThermostat.getThermostatMode())), String(myThermostat.getSensorCalibFactor()), String(myThermostat.getSensorCalibOffset()), WiFi.localIP().toString(), FIRMWARE_VERSION), true, 1);
      }

      myMqttClient.loop();
      delay(20); // <- fixes some issues with WiFi stability
   }
}

void HANDLE_HTTP_UPDATE(void)
{
   if (FETCH_UPDATE == true)
   {
      DRAW_DISPLAY_MAIN();
      FETCH_UPDATE = false;
      Serial.printf("Remote update started");

      t_httpUpdate_return ret = ESPhttpUpdate.update(myUpdateServer);

      switch(ret) {
          case HTTP_UPDATE_FAILED:
              Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
              break;

          case HTTP_UPDATE_NO_UPDATES:
             Serial.println("HTTP_UPDATE_NO_UPDATES");
              break;

          case HTTP_UPDATE_OK:
             Serial.println("HTTP_UPDATE_OK");
              break;
      }
   }
}

void HANDLE_OTA_UPDATE(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      ArduinoOTA.handle();
   }
}

void SPIFFS_MAIN(void)
{
   if (myMqttConfig.getNameChanged())
   {
      mySystemState.setSystemRestartRequest(true);

      if (!writeSpiffs(SPIFFS_MQTT_ID_FILE, myMqttConfig.getName()))
      {
         #ifdef CFG_DEBUG
         Serial.println("Writing to file: " + SPIFFS_MQTT_ID_FILE + " returned no success");
         #endif
         /* ToDo: implement retry */
      }
   }

   if(myThermostat.getNewCalib())
   {
      mySystemState.setSystemRestartRequest(true);

      if (!writeSpiffs(SPIFFS_SENSOR_CALIB_FILE, String(myThermostat.getSensorCalibOffset()) + ";" + String(myThermostat.getSensorCalibFactor())))
      {
         #ifdef CFG_DEBUG
         Serial.println("Writing to file: " + SPIFFS_SENSOR_CALIB_FILE + " returned no success");
         #endif
         /* ToDo: implement retry */
      }

   }

   /* avoid extensive writing to SPIFFS, therefore check if the target temperature didn't change for a certain time before writing. */
   if (myThermostat.getTargetTemperature() != SPIFFS_LAST_TARGET_TEMPERATURE)
   {
      #ifdef CFG_DEBUG
      Serial.println("Target temperature changed from. " + String(SPIFFS_LAST_TARGET_TEMPERATURE) + " to: " + String(myThermostat.getTargetTemperature()));
      #endif

      SPIFFS_REFERENCE_TIME = millis();
      SPIFFS_LAST_TARGET_TEMPERATURE = myThermostat.getTargetTemperature();
      SPIFFS_WRITTEN = false;
   }
   else /* target temperature not changed this loop */
   {
      if (SPIFFS_WRITTEN == true)
      {
         /* do nothing, last change was already stored in SPIFFS */
      }
      else /* latest change not stored in SPIFFS */
      {
         if (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE < millis()) /* check debounce */
         {
            /* debounce expired -> write */
            if (writeSpiffs(SPIFFS_TARGET_TEMP_FILE, String(myThermostat.getTargetTemperature())))
            {
               SPIFFS_WRITTEN = true;
            }
            else
            {
               #ifdef CFG_DEBUG
               Serial.println("Writing to file: " + SPIFFS_TARGET_TEMP_FILE + " returned no success, retry next loop");
               #endif
            }

            #ifdef CFG_DEBUG
            Serial.println("New target temperature: " + String(myThermostat.getTargetTemperature()) + " stored in SPIFFS");
            #endif
         }
         else
         {
            /* debounce SPIFFS write */
            #ifdef CFG_DEBUG
            if ( (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE - millis()) % 100 == 0 ) /* modulo 100 to avoid excessive prints while debouncing */
            {
               Serial.println("Debouncing at: " + String((SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE - millis())));
            }
            #endif
         }
      }
   }
}
/*===================================================================================================================*/
/* callback, interrupt, timer functions */
/*===================================================================================================================*/

void ICACHE_RAM_ATTR encoderSwitch(void)
{
   /* debouncing routine for encoder switch */
   if (TimeReached(switchDebounceTime))
   {
      SetNextTimeInterval(switchDebounceTime, switchDebounceInterval);
      myThermostat.toggleThermostatMode();
   }
}

void ICACHE_RAM_ATTR updateEncoder(void)
{
   int MSB = digitalRead(ENCODER_PIN1);
   int LSB = digitalRead(ENCODER_PIN2);

   int encoded = (MSB << 1) |LSB;  /* converting the 2 pin value to single number */

   int sum  = (LAST_ENCODED << 2) | encoded; /* adding it to the previous encoded value */

